01_dropletSpreading/01_baseCase/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;

vertices
(
    (  0 -40    0)
    (  0  40    0)
    (  0  40   10)
    (  0 -40   10)
    (  1 -40    0)
    (  1  40    0)
    (  1  40   10)
    (  1 -40   10)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (150 50 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    Walls
    {
        type wall;
        faces
        (
            (0 4 7 3)
            (1 5 6 2)
            (0 4 5 1)
            (3 7 6 2)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
