01_dropletSpreading/01_baseCase/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

2
(
    Walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          400;
        startFace       14800;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          15000;
        startFace       15200;
    }
)

// ************************************************************************* //
