01_dropletSpreading/01_baseCase/system/setFieldsDict2D
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.liquid 0
);

regions
(
    cylinderToCell
          {
              p1 (0.000 0 0); //Min
              p2 (0.001 0 0); //Max
              radius 0.005;
              
              fieldValues
              (
                  volScalarFieldValue alpha.liquid 1
              );
          }
);


// ************************************************************************* //
